; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v11 ?v6)
             (pred_7 ?v7 ?v1)
             (pred_11 ?v11 ?v1)
             (pred_4 ?v2 ?v11 )
	     (pred_1 ?v11)
             (pred_6 ?v4)
             (pred_8 ?v7)
             (pred_9 ?v1)
             (pred_10 ?v11)
             (pred_5 ?v7)
             (pred_3 ?v11)
             (pred_2 ))



(:action op_4
:parameters (?v13 ?v8 ?v12 ?v5)
:precondition (and (pred_6 ?v13) (pred_6 ?v8) (pred_8 ?v12) (pred_9 ?v5)
          (pred_12 ?v13 ?v8) (pred_7 ?v12 ?v5)
                   (pred_11 ?v8 ?v5) (pred_1 ?v13) 
                   (pred_10 ?v8) (pred_5 ?v12))
:effect (and  (pred_3 ?v8) (not (pred_10 ?v8))))


(:action op_5
:parameters (?v13 ?v10)
:precondition (and (pred_6 ?v13) (pred_6 ?v10)
               (pred_1 ?v13) (pred_12 ?v13 ?v10) (pred_3 ?v10))
:effect (and (pred_1 ?v10) (not (pred_1 ?v13))))

(:action op_1
:parameters (?v13 ?v12)
:precondition (and (pred_6 ?v13) (pred_8 ?v12) 
                  (pred_1 ?v13) (pred_4 ?v12 ?v13) (pred_2 ))
:effect (and (pred_5 ?v12)
   (not (pred_4 ?v12 ?v13)) (not (pred_2 ))))


(:action op_3
:parameters (?v13 ?v3 ?v9)
:precondition (and (pred_6 ?v13) (pred_8 ?v3) (pred_8 ?v9)
                  (pred_1 ?v13) (pred_5 ?v9) (pred_4 ?v3 ?v13))
:effect (and (pred_5 ?v3) (pred_4 ?v9 ?v13)
        (not (pred_5 ?v9)) (not (pred_4 ?v3 ?v13))))

(:action op_2
:parameters (?v13 ?v12)
:precondition (and (pred_6 ?v13) (pred_8 ?v12) 
                  (pred_1 ?v13) (pred_5 ?v12))
:effect (and (pred_2 ) (pred_4 ?v12 ?v13) (not (pred_5 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_21 obj_19 obj_11 obj_06 obj_12 obj_03 obj_15 obj_16 obj_17 obj_01 obj_08 obj_20 obj_05 obj_10 obj_07
    obj_14 obj_13
    obj_02 obj_18 obj_09
    )

    (:init
       (pred_2)

       (pred_6 obj_04)
       (pred_6 obj_21)
       (pred_6 obj_19)
       (pred_6 obj_11)
       (pred_6 obj_06)
       (pred_6 obj_12)
       (pred_6 obj_03)
       (pred_6 obj_15)
       (pred_6 obj_16)
       (pred_6 obj_17)
       (pred_6 obj_01)
       (pred_6 obj_08)
       (pred_6 obj_20)
       (pred_6 obj_05)
       (pred_6 obj_10)
       (pred_6 obj_07)
       (pred_9 obj_14)
       (pred_9 obj_13)
       (pred_8 obj_02)
       (pred_8 obj_18)
       (pred_8 obj_09)

       (pred_12 obj_04 obj_06)
       (pred_12 obj_04 obj_21)
       (pred_12 obj_21 obj_12)
       (pred_12 obj_21 obj_19)
       (pred_12 obj_21 obj_04)
       (pred_12 obj_19 obj_03)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_19 obj_21)
       (pred_12 obj_11 obj_15)
       (pred_12 obj_11 obj_19)
       (pred_12 obj_06 obj_16)
       (pred_12 obj_06 obj_12)
       (pred_12 obj_06 obj_04)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_03)
       (pred_12 obj_12 obj_21)
       (pred_12 obj_12 obj_06)
       (pred_12 obj_03 obj_01)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_03 obj_19)
       (pred_12 obj_03 obj_12)
       (pred_12 obj_15 obj_08)
       (pred_12 obj_15 obj_11)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_16 obj_20)
       (pred_12 obj_16 obj_17)
       (pred_12 obj_16 obj_06)
       (pred_12 obj_17 obj_05)
       (pred_12 obj_17 obj_01)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_17 obj_16)
       (pred_12 obj_01 obj_10)
       (pred_12 obj_01 obj_08)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_01 obj_17)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_08 obj_15)
       (pred_12 obj_08 obj_01)
       (pred_12 obj_20 obj_05)
       (pred_12 obj_20 obj_16)
       (pred_12 obj_05 obj_10)
       (pred_12 obj_05 obj_17)
       (pred_12 obj_05 obj_20)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_10 obj_01)
       (pred_12 obj_10 obj_05)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_07 obj_10)
       (pred_10 obj_16)
       (pred_10 obj_21)
       (pred_10 obj_08)
       (pred_11  obj_16 obj_14)
       (pred_11  obj_21 obj_13)
       (pred_11  obj_08 obj_14)
       (pred_3 obj_04)
       (pred_3 obj_19)
       (pred_3 obj_11)
       (pred_3 obj_06)
       (pred_3 obj_12)
       (pred_3 obj_03)
       (pred_3 obj_15)
       (pred_3 obj_17)
       (pred_3 obj_01)
       (pred_3 obj_20)
       (pred_3 obj_05)
       (pred_3 obj_10)
       (pred_3 obj_07)

       (pred_7  obj_02 obj_14)
       (pred_7  obj_18 obj_13)
       (pred_7  obj_09 obj_13)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_18 obj_11)
       (pred_4 obj_09 obj_11)
       (pred_1 obj_03)
    )

    (:goal (and
       (pred_4 obj_02 obj_03)
       (pred_4 obj_18 obj_01)
       (pred_4 obj_09 obj_20)
    ))
(:constraints
  (always (not (pred_1 obj_19)))
)
)

; plan
1. (op_5 obj_03 obj_12)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_12)
   goals met: 0 of 3
2. (op_1 obj_12 obj_02)
   deleted: (pred_4 obj_02 obj_12) (pred_2)
   added: (pred_5 obj_02)
   goals met: 0 of 3
3. (op_5 obj_12 obj_03)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_03)
   goals met: 0 of 3
4. (op_2 obj_03 obj_02)
   deleted: (pred_5 obj_02)
   added: (pred_2) (pred_4 obj_02 obj_03)
   goals met: 1 of 3
5. (op_5 obj_03 obj_15)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_15)
   goals met: 1 of 3
6. (op_5 obj_15 obj_11)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_11)
   goals met: 1 of 3
7. (op_1 obj_11 obj_18)
   deleted: (pred_4 obj_18 obj_11) (pred_2)
   added: (pred_5 obj_18)
   goals met: 1 of 3
8. (op_5 obj_11 obj_15)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_15)
   goals met: 1 of 3
9. (op_5 obj_15 obj_03)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_03)
   goals met: 1 of 3
10. (op_5 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_01)
   goals met: 1 of 3
11. (op_2 obj_01 obj_18)
   deleted: (pred_5 obj_18)
   added: (pred_2) (pred_4 obj_18 obj_01)
   goals met: 2 of 3
12. (op_5 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 2 of 3
13. (op_5 obj_03 obj_15)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_15)
   goals met: 2 of 3
14. (op_5 obj_15 obj_11)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_11)
   goals met: 2 of 3
15. (op_1 obj_11 obj_09)
   deleted: (pred_4 obj_09 obj_11) (pred_2)
   added: (pred_5 obj_09)
   goals met: 2 of 3
16. (op_5 obj_11 obj_15)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_15)
   goals met: 2 of 3
17. (op_5 obj_15 obj_03)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_03)
   goals met: 2 of 3
18. (op_5 obj_03 obj_12)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_12)
   goals met: 2 of 3
19. (op_5 obj_12 obj_17)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_17)
   goals met: 2 of 3
20. (op_5 obj_17 obj_05)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_05)
   goals met: 2 of 3
21. (op_5 obj_05 obj_20)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_20)
   goals met: 2 of 3
22. (op_2 obj_20 obj_09)
   deleted: (pred_5 obj_09)
   added: (pred_2) (pred_4 obj_09 obj_20)
   goals met: 3 of 3
